---
kind: property
id: P:Autodesk.Revit.DB.LeaderArray.Size
source: html/1963529c-9da9-e7c7-6f7f-912db89f59b5.htm
---
# Autodesk.Revit.DB.LeaderArray.Size Property

Returns the number of objects that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```